
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УдалитьПомеченныеНаУдаление ();
КонецПроцедуры

&НаСервере
Процедура УдалитьПомеченныеНаУдаление ()
	Помеченные = НайтиПомеченныеНаУдаление();
	Если НЕ Помеченные.Количество() Тогда
		Сообщить ("Отсутствуют помеченные на удаление объекты.");
		Возврат;
	КонецЕсли;
	Найденные = 0;
	УдалитьОбъекты(Помеченные, Истина, Найденные);
	Если Найденные.Количество() Тогда
		Сообщить ("Не все объекты могут быть удалены.");
	КонецЕсли;	
	Для каждого стр из Найденные Цикл
	    СтрСообщения = "Объект не удален: " + СокрЛП(стр[0]);
	    СтрСсылкаИспользования = ", используется в " + СокрЛП(стр[1]);
	    Сообщить (СтрСообщения + СтрСсылкаИспользования);
	КонецЦикла;
	Сообщить ("Удаление объектов завершено.");	
КонецПроцедуры